app/views/posts/_form.html.erb

SELECT 1 AS one FROM "linkedin_accounts" WHERE "linkedin_accounts"."user_id" = 1 LIMIT 1
---
        <%= form.label :linkedin_account_id, "Connect LinkedIn Account", class: "block text-gray-300 font-semibold mb-2" %>
        <% if current_user.linkedin_accounts.any? %>